FemDesign.Loads.LoadGroupPermanent
permanent_load_group (child of general_load_group)

FemDesign.Loads.LoadGroupPermanent.#ctor
parameterless constructor for serialization

FemDesign.Loads.LoadGroupPermanent.#ctor(System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.List{FemDesign.Loads.LoadCase},FemDesign.Loads.ELoadGroupRelationship,System.Double,System.String)
Public constructor.
standardFavourable: Safety factor for favourable load.
standardUnfavourable: Safety factor for unfavourable load.
accidentalFavourable: Safety factor for favourable load for accidental load combinations.
accidentalUnfavourable: Safety factor for unfavourable load for accidental load combinations.
loadCases: List of load cases in the load group
relationsship: Specifies how to condider the load cases in combinations
xi: Xi-factor used in the combinations, see EN 1990.